openfoam/cfd_v2_mesh_independence/cases/fine/constant/physicalProperties
FoamFile { format ascii; class dictionary; object physicalProperties; }

viscosityModel constant;
nu 1.48e-05;

