openfoam/cfd_v2_mesh_independence/cases/fine/system/fvSolution
FoamFile { format ascii; class dictionary; object fvSolution; }

solvers
{
    p
    {
        solver          GAMG;
        smoother        GaussSeidel;
        tolerance       1e-08;
        relTol          0.05;
    }
    Phi { $p; }
    U
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-08;
        relTol          0.05;
        nSweeps         1;
    }
    "(k|omega)"
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-08;
        relTol          0.05;
        nSweeps         1;
    }
}

SIMPLE
{
    nNonOrthogonalCorrectors 1;
    consistent      no;
    residualControl
    {
        p           1e-5;
        U           1e-6;
        "(k|omega)" 1e-6;
    }
}

potentialFlow { nNonOrthogonalCorrectors 10; }

relaxationFactors
{
    fields { p 0.25; }
    equations
    {
        U       0.5;
        k       0.5;
        omega   0.5;
    }
}

cache { grad(U); }

